PruteanuVlad/licenta_public/nod_periferic/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PTA19_Init
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void PTA19_Init(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);

    gpio_pin_config_t RELAY2_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA19 (pin 7)  */
    GPIO_PinInit(PTA19_INIT_RELAY2_1_GPIO, PTA19_INIT_RELAY2_1_PIN, &RELAY2_1_config);

    /* PORTA19 (pin 7) is configured as PTA19 */
    PORT_SetPinMux(PTA19_INIT_RELAY2_1_PORT, PTA19_INIT_RELAY2_1_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PTC16_Init:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '45', peripheral: GPIOC, signal: 'GPIO, 16', pin_signal: PTC16/LLWU_P0/RF_STATUS/SPI0_SCK/I2C0_SDA/LPUART0_RTS_b/TPM0_CH3/LPUART1_RTS_b, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PTC16_Init
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void PTC16_Init(void)
{
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t RELAY2_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC16 (pin 45)  */
    GPIO_PinInit(PTC16_INIT_RELAY2_2_GPIO, PTC16_INIT_RELAY2_2_PIN, &RELAY2_2_config);

    /* PORTC16 (pin 45) is configured as PTC16 */
    PORT_SetPinMux(PTC16_INIT_RELAY2_2_PORT, PTC16_INIT_RELAY2_2_PIN, kPORT_MuxAsGpio);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
